CREATE OR REPLACE FUNCTION get_hyphen_nashi_date(in_ymd character varying)
RETURNS NUMERIC AS $$
/**********************************************************************************************************************/
/* 処理概要 : 日付項目にて「-」を削除                                                */
/* 引数     : in_ymd … 日付                                                                                           */
/* 戻り値    : NUMERIC … 変換後日付                                                                                */
/*--------------------------------------------------------------------------------------------------------------------*/
/* 履歴     : 2025/01/22  CRESS-INFO.Drexler   新規作成                                                                */
/**********************************************************************************************************************/
BEGIN
    return REPLACE(in_ymd, '-', '')::numeric;

EXCEPTION
    WHEN OTHERS THEN
        -- 日付エラーの場合
        RETURN 0;
END;
$$ LANGUAGE plpgsql;
